# Програма для аналізу температурних показів за день

print("Аналіз температурних показів за день")
print("Введіть до 24 значень температур (через пробіл):")

# Введення температур користувачем
### TODO: організувати ввод послідовності одним рядком, дані очистити від зайвих пробілів та розділити покази у рядку на список по пробілам між ними
t_input = input("Температури: ").strip()
t_str = t_input.split()

# Перевірка кількості значень
### TODO: Перевірити, що було введено не пустий рядок (0 показів) та що загальна кількість показів не перевищує 24, інакше забезпечити вихід з програми
if len(t_str) == 0:
    print("Помилка: не введено жодного значення.")
    exit()

if len(t_str) > 24:
    print("Помилка: Максимальна кількість вимірювань не повинна перевищувати 24.")
    exit()

# Створення та наповнення списку для числових значень показів температур
### TODO: Створення списку та перевірка коректності кожного числа: 
### а) має бути таким, щоб його можна було перетворити на float 
###  б) входить у діапазон допустимих температур (-40..40)
tt = []

for t in t_str:
    try:
        value = float(t)
    except:
        print("Помилка:", t, "не є числом.")
        exit()

    if value < -40 or value > 40:
        print("Помилка: температура", value, "поза допустимим діапазоном [-40..40].")
        exit()

    tt.append(value)

# Перевірка, чи додались у список хоч якісь дані (список с числовими показами містить значення), інакше завершити програму
### TODO: перевірити, що список не пустий і містить хоча б два значення
n = len(tt)
if n < 2:
    print("Помилка: потрібно щонайменше два значення температури.")
    exit()

# Введення часових міток
print("\nВведіть часові мітки для кожного показу (у форматі 'година:хвилина') через пробіл:")

### TODO: організувати ввод послідовності одним рядком, дані очистити від зайвих пробілів та розділити покази у рядку на список по пробілам між ними
time_input = input("Мітки часу: ").strip()
time_str = time_input.split()

# Перевірка кількості міток
### TODO: перевірити, що кількість показників температури та кількість міток збігається, інакше завершити програму
if len(time_str) != n:
    print("Помилка: кількість часових міток не відповідає кількості показників температури.")
    exit()

# Перевірка формату часу
### TODO: перевірити, що формат міток відповідає заданому ("Година:Хвилина"), не має зайвих символів
# та значення годин та хвилин - у правильному діапазоні (0-23 та 0-59)
times = []
for t in time_str:
    parts = t.split(":")
    if len(parts) != 2:
        print("Помилка: неправильний формат часу", t)
        exit()
    try:
        hour = int(parts[0])
        minute = int(parts[1])
    except:
        print("Помилка: некоректне значення", t)
        exit()
    if hour < 0 or hour > 23 or minute < 0 or minute > 59:
        print("Помилка: час", t, "поза допустимим діапазоном.")
        exit()
    # якщо користувач ввів 5 (годин), то запишемо їх як 05
    if hour < 10:
        hour_str = "0" + str(hour)
    else:
        hour_str = str(hour)
    # якщо користувач ввів 5 (хвилин), то запишемо їх як 05
    if minute < 10:
        minute_str = "0" + str(minute)
    else:
        minute_str = str(minute)
    times.append(hour_str + ":" + minute_str)

# Створення словника {час: температура, час: температура, ...}
### TODO: створити та наповнити словник
my_dict = {}
my_dict = dict(zip(times, tt)) # zip створює пари (times[i], tt[i])

# === Обчислення характеристик через словник з даними ===
### TODO: зробити розрахунок статистичних параметрів (середнє значення, мінімум, максимум, кількість позитивних та негативних температур, різкі зміни) по даним зі словника
### а) виділити значення та ключі зі словника
### б) розрахувати середнє значення
### в) розрахувати мінімум та максимум
### г) розрахувати кількість позитивних та негативних температур
### д) зробити виявлення різких змін: зробити список, в якому зберігати кортеж-діапазон часових міток, між якими стався різкий перепад температур (>7 градусів), та різниця температур (час1, час2, різниця)

# а) - г)
avg_t = sum(my_dict.values()) / len(my_dict)
min_t = min(my_dict.values())
max_t = max(my_dict.values())
pos_count = sum(1 for t in my_dict.values() if t > 0)
neg_count = sum(1 for t in my_dict.values() if t < 0)

# д)
big_changes = []
time_keys = list(my_dict.keys())
for i in range(len(time_keys) - 1):
    t1 = time_keys[i]
    t2 = time_keys[i + 1]
    diff = abs(my_dict[t2] - my_dict[t1])
    if diff > 7:
        big_changes.append((t1, t2, diff))

# === Виведення результатів ===
print("\nРЕЗУЛЬТАТ АНАЛІЗУ")
print("Температурні дані (час → температура):")
### TODO: вивести усі покази у форматі "часова мітка" - "значення температури" зі словника

# Ця функція форматує температуру у виводі: 3 → 3.00 → 3°С, 5.333 → 5.33°С
def format_temp(t):
    return str(int(t)) if t.is_integer() else f"{t:.2f}"

for time, tt in my_dict.items():
    print(f"{time} → {format_temp(tt)}°С")

### TODO: вивести отримані числові значення статистичних показників
print("\nЗагальна кількість вимірювань:", n)
print(f"Середня температура: {format_temp(avg_t)}°С")
print(f"Максимальна температура: {format_temp(max_t)}°С")
print(f"Мінімальна температура: {format_temp(min_t)}°С")
print("Кількість додатних температур:", pos_count)
print("Кількість від’ємних температур:", neg_count)

# Виведення різких змін
### TODO: за утвореним списком з кортежів (час1, час2, різниця) вивести повідомлення про різкі зміни
if len(big_changes) > 0:
    print("\n[!] Виявлено різкі зміни температури (> 7°):")
    for t1, t2, diff in big_changes:
        print(f"між {t1} та {t2}: зміна на {format_temp(diff)}°С")
else:
    print("\nРізких змін температури не виявлено.")

print("\nКінець аналізу")